# pandas tutorial (day_11)
This notebook explains about python.....

Install libraries

In [59]:
# pip install pandas
# pip install numpy

- **Import libraries**

In [60]:
import pandas as pd
import numpy as np

In [61]:
# object creation
s = pd.Series([1,3,5,7,8,9])
s

0    1
1    3
2    5
3    7
4    8
5    9
dtype: int64

In [62]:
# empty cell creation
s = pd.Series([1,3,np.nan,5,7,8,9])
s

0    1.0
1    3.0
2    NaN
3    5.0
4    7.0
5    8.0
6    9.0
dtype: float64

In [63]:
#date object
dates = pd.date_range("20130101", periods=6) #period indicate days
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [64]:
#date object
dates = pd.date_range("20220101", periods=20) #period indicate days
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15', '2022-01-16',
               '2022-01-17', '2022-01-18', '2022-01-19', '2022-01-20'],
              dtype='datetime64[ns]', freq='D')

In [65]:
#date series convert to dataframe which is worksheet or rows or column
dates = pd.date_range("20130101", periods=6) #period indicate days
dates
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.266686  0.450591  0.144209  1.242299
2013-01-02  3.053969 -0.543541  0.075838 -0.123105
2013-01-03  0.041529 -0.713329  0.302621 -0.288699
2013-01-04  1.253005  2.121205  0.098592  0.449102
2013-01-05  0.219945 -1.001794  0.727921 -0.203670
2013-01-06  0.034497 -0.829297  0.929913 -0.518783

In [67]:
#data type
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [68]:
#Viewing data
df.head(4)

                   A         B         C         D
2013-01-01  1.266686  0.450591  0.144209  1.242299
2013-01-02  3.053969 -0.543541  0.075838 -0.123105
2013-01-03  0.041529 -0.713329  0.302621 -0.288699
2013-01-04  1.253005  2.121205  0.098592  0.449102

In [69]:
df.tail(2)

                   A         B         C         D
2013-01-05  0.219945 -1.001794  0.727921 -0.203670
2013-01-06  0.034497 -0.829297  0.929913 -0.518783

In [70]:
#Display the index, columns: or head of row
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [71]:
# DataFrame.to_numpy() or array
df.to_numpy()

array([[ 1.26668567,  0.45059092,  0.14420857,  1.242299  ],
       [ 3.05396946, -0.54354064,  0.0758384 , -0.12310519],
       [ 0.04152878, -0.71332883,  0.30262122, -0.28869909],
       [ 1.25300547,  2.12120482,  0.09859207,  0.44910165],
       [ 0.21994465, -1.00179378,  0.72792086, -0.20367046],
       [ 0.03449742, -0.82929664,  0.92991303, -0.51878343]])

In [72]:
df2.to_numpy()

array([[1.0, Timestamp('2022-01-11 00:00:00'), 1.0, 3, 'girl', 'female'],
       [1.0, Timestamp('2022-01-11 00:00:00'), 1.0, 3, 'women', 'female'],
       [1.0, Timestamp('2022-01-11 00:00:00'), 1.0, 3, 'girl', 'female'],
       [1.0, Timestamp('2022-01-11 00:00:00'), 1.0, 3, 'women', 'female']],
      dtype=object)

In [73]:
#describe() shows a quick statistic summary of your data:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.978272 -0.086027  0.379849  0.092857
std    1.167085  1.196138  0.362420  0.648442
min    0.034497 -1.001794  0.075838 -0.518783
25%    0.086133 -0.800305  0.109996 -0.267442
50%    0.736475 -0.628435  0.223415 -0.163388
75%    1.263266  0.202058  0.621596  0.306050
max    3.053969  2.121205  0.929913  1.242299

In [74]:
#Transposing data: #rows to col and viceversa
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2022-01-11 00:00:00,2022-01-11 00:00:00,2022-01-11 00:00:00,2022-01-11 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,girl,women,girl,women
F,female,female,female,female

In [75]:
#Sorting by an axis:
df.sort_index(axis=1, ascending=False) #you may write true here. or may write axis = 0

                   D         C         B         A
2013-01-01  1.242299  0.144209  0.450591  1.266686
2013-01-02 -0.123105  0.075838 -0.543541  3.053969
2013-01-03 -0.288699  0.302621 -0.713329  0.041529
2013-01-04  0.449102  0.098592  2.121205  1.253005
2013-01-05 -0.203670  0.727921 -1.001794  0.219945
2013-01-06 -0.518783  0.929913 -0.829297  0.034497

In [76]:
#Sorting by values:eg by considering b here
df.sort_values(by="B",ascending=False)

                   A         B         C         D
2013-01-04  1.253005  2.121205  0.098592  0.449102
2013-01-01  1.266686  0.450591  0.144209  1.242299
2013-01-02  3.053969 -0.543541  0.075838 -0.123105
2013-01-03  0.041529 -0.713329  0.302621 -0.288699
2013-01-06  0.034497 -0.829297  0.929913 -0.518783
2013-01-05  0.219945 -1.001794  0.727921 -0.203670

In [77]:
#Selection
df["C"]

2013-01-01    0.144209
2013-01-02    0.075838
2013-01-03    0.302621
2013-01-04    0.098592
2013-01-05    0.727921
2013-01-06    0.929913
Freq: D, Name: C, dtype: float64

In [78]:
#Selecting via [], which slices the rows. or string method or indexing or 0 to 2 rows or selection basedon rows 
df[0:2]

                   A         B         C         D
2013-01-01  1.266686  0.450591  0.144209  1.242299
2013-01-02  3.053969 -0.543541  0.075838 -0.123105

In [79]:
#Selection by label # row wise
df.loc[dates[5]]

A    0.034497
B   -0.829297
C    0.929913
D   -0.518783
Name: 2013-01-06 00:00:00, dtype: float64

In [80]:
#If we want data of a and b # this sign indicate  diference between :(rows and col)
df.loc[:, ["A", "B"]] # here selection is col wise

                   A         B
2013-01-01  1.266686  0.450591
2013-01-02  3.053969 -0.543541
2013-01-03  0.041529 -0.713329
2013-01-04  1.253005  2.121205
2013-01-05  0.219945 -1.001794
2013-01-06  0.034497 -0.829297

In [81]:
df.loc["20220102":"20220104", ["A", "B","C"]]

Empty DataFrame
Columns: [A, B, C]
Index: []

In [82]:
df.loc["20130102", ["A", "B"]]

A    3.053969
B   -0.543541
Name: 2013-01-02 00:00:00, dtype: float64

In [83]:
df.at[dates[2], "A"] # give date and check value of A

0.04152878383715947

In [84]:
#Selection by position
df.iloc[3] # what is in 3rd position of d

A    1.253005
B    2.121205
C    0.098592
D    0.449102
Name: 2013-01-04 00:00:00, dtype: float64

In [85]:
#Selection by position by giving range
df.iloc[3:10] # what is in 3rd position of d

     A          B    C  D      E       F
3  1.0 2022-01-11  1.0  3  women  female

In [88]:
df.iloc[0:5, 0:3] #specific selection on giving range of rows and columns

                   A         B         C
2013-01-01  1.266686  0.450591  0.144209
2013-01-02  3.053969 -0.543541  0.075838
2013-01-03  0.041529 -0.713329  0.302621
2013-01-04  1.253005  2.121205  0.098592
2013-01-05  0.219945 -1.001794  0.727921

In [90]:
#if you want all the data #donot write anything anything on side of colon, :
df.iloc[0:5, :]

                   A         B         C         D
2013-01-01  1.266686  0.450591  0.144209  1.242299
2013-01-02  3.053969 -0.543541  0.075838 -0.123105
2013-01-03  0.041529 -0.713329  0.302621 -0.288699
2013-01-04  1.253005  2.121205  0.098592  0.449102
2013-01-05  0.219945 -1.001794  0.727921 -0.203670

In [91]:
#Boolean indexing
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  1.266686  0.450591  0.144209  1.242299
2013-01-02  3.053969 -0.543541  0.075838 -0.123105
2013-01-03  0.041529 -0.713329  0.302621 -0.288699
2013-01-04  1.253005  2.121205  0.098592  0.449102
2013-01-05  0.219945 -1.001794  0.727921 -0.203670
2013-01-06  0.034497 -0.829297  0.929913 -0.518783

In [92]:
#Boolean indexing
df[df["A"] > 1.5]

                   A         B         C         D
2013-01-02  3.053969 -0.543541  0.075838 -0.123105